% Студент, тип обучения
student("Прянишников", "Бюджет").
student("Богаченко", "Бюджет").
student("Серова", "Бюджет").
student("Шелия", "Бюджет").
student("Межеровский", "Платка").

% Студент, интерес
studentInterests("Прянишников", "Компьютерная графика").
studentInterests("Прянишников", "Моделирование").
studentInterests("Богаченко", "LMS").
studentInterests("Серова", "Компьютерная графика").
studentInterests("Серова", "Моделирование").
studentInterests("Шелия", "БД").

% Предпочтения студента
studentsLove("Прянишников", "Кузнецова").
studentsLove("Богаченко", "Строганов").
studentsLove("Серова", "Строганов").

% Преподаватель, каких берёт, сколько
teacher("Строганов", "Бюджет", 1).
teacher("Строганов", "Платка", 1).
teacher("Кузнецова", "Бюджет", 2).
teacher("Гаврилова", "Бюджет", 1).

% Преподаватель, интерес
teacherInterests("Строганов", "LMS").
teacherInterests("Гаврилова", "БД").

% Предпочтения препода
teacherLove("Строганов", "Богаченко").
teacherLove("Строганов", "Серова").

teacherLove("Кузнецова", "Прянишников").

student("Трошкин", "Бюджет").
studentInterests("Трошкин", "Компьютерная графика").
studentInterests("Трошкин", "Криптография").
studentsLove("Трошкин", "Кузнецова").

teacher("Кузнецов", "Бюджет", 2).
teacher("Кузнецов", "Платка", 0).
teacherInterests("Кузнецов", "Операционные системы").
teacherInterests("Кузнецов", "Анализ данных").
teacherLove("Кузнецов", "Прянишников").

student("Солнцева", "Бюджет").
studentInterests("Солнцева", "Чилл").
studentsLove("Солнцева", "Кузнецова").

teacher("Куров", "Бюджет", 1).
teacher("Куров", "Платка", 0).
teacherInterests("Куров", "Компьютерная графика").

student("Малышев", "Бюджет").
studentInterests("Малышев", "Компьютерная графика").

teacher("Толпинская", "Бюджет", 1).
teacher("Толпинская", "Платка", 1).
teacherInterests("Толпинская", "Компьютерные сети").
teacherInterests("Толпинская", "Блокчейн").

student("Кузьмин", "Бюджет").

teacher("Борисов", "Бюджет", 1).
teacher("Борисов", "Платка", 1).

teacher("Тассов", "Бюджет", 1).
teacher("Тассов", "Платка", 0).
teacherInterests("Тассов", "Компьютерные сети").
